## <a href = 'https://8weeksqlchallenge.com/case-study-2/'>Pizza Runner</a>

#### Introduction

<img src = 'https://8weeksqlchallenge.com/images/case-study-designs/2.png'>

<br>

Did you know that over 115 million kilograms of pizza is consumed daily worldwide??? (Well according to Wikipedia anyway…)

Danny was scrolling through his Instagram feed when something really caught his eye - “80s Retro Styling and Pizza Is The Future!”

Danny was sold on the idea, but he knew that pizza alone was not going to help him get seed funding to expand his new Pizza Empire - so he had one more genius idea to combine with it - he was going to Uberize it - and so Pizza Runner was launched!

Danny started by recruiting “runners” to deliver fresh pizza from Pizza Runner Headquarters (otherwise known as Danny’s house) and also maxed out his credit card to pay freelance developers to build a mobile app to accept orders from customers.

#### Case Study Questions - Part A

1. How many pizzas were ordered?
2. How many unique customer orders were made?
3. How many successful orders were delivered by each runner?
4. How many of each type of pizza was delivered?
5. How many Vegetarian and Meatlovers were ordered by each customer?
6. What was the maximum number of pizzas delivered in a single order?
7. For each customer, how many delivered pizzas had at least 1 change and how many had no changes?
8. How many pizzas were delivered that had both exclusions and extras?
9. What was the total volume of pizzas ordered for each hour of the day?
10. What was the volume of orders for each day of the week?

In [1]:
import sql
from sqlalchemy import create_engine


%load_ext sql
%sql sqlite://

Tables as per link above

In [2]:
%%sql
DROP TABLE IF EXISTS runner_orders;
CREATE TABLE runner_orders("order_id" INTEGER,
                           "runner_id" INTEGER,
                           "pickup_time" VARCHAR(19),
                           "distance" VARCHAR(7),
                           "duration" VARCHAR(10),
                           "cancellation" VARCHAR(23)
);

INSERT INTO runner_orders
    ("order_id", "runner_id", "pickup_time", "distance", "duration", "cancellation")
VALUES
    (1, 1, "2021-01-01 18:15:34", "20km", "32 minutes", ""),
    (2, 1, "2021-01-01 19:10:54", "20km", "27 minutes", ""),
    (3, 1, "2021-01-03 00:12:37", "13.4km", "20 mins", NULL),
    (4, 2, "2021-01-04 13:53:03", "23.4", "40", NULL),
    (5, 3, "2021-01-08 21:10:57", "10", "15", NULL),
    (6, 3, null, null, null, "Restaurant Cancellation"),
    (7, 2, "2020-01-08 21:30:45", "25km", "25mins", null),
    (8, 2, "2020-01-10 00:15:02", "23.4 km", "15 minute", null),
    (9, 2, null, null, null, "Customer Cancellation"),
    (10, 1, "2020-01-11 18:50:20", "10km", "10minutes", null);

 * sqlite://
Done.
Done.
10 rows affected.

[]

In [3]:
%%sql
DROP TABLE IF EXISTS runners;
CREATE TABLE runners("runner_id" INTEGER,
                     "registration_date" DATE);
INSERT INTO runners
    ("runner_id", "registration_date")
VALUES
    (1, 2021-01-01),
    (2, 2021-01-03),
    (3, 2021-01-08),
    (4, 2021-01-15);

 * sqlite://
Done.
Done.
4 rows affected.

[]

In [61]:
%%sql
DROP TABLE IF EXISTS customer_orders;
CREATE TABLE customer_orders("order_id" INTEGER,
                             "customer_id" INTEGER,
                             "pizza_id" INTEGER,
                             "exclusions" VARCHAR(4),
                             "extras" VARCHAR(4),
                             "order_time" TIMESTAMP);
INSERT INTO customer_orders
    ("order_id", "customer_id", "pizza_id", "exclusions", "extras", "order_time")
VALUES
    (1,  101, 1, " ", " ", "2021-01-01 18:05:02"),
    (2,  101, 1, " ", " ", "2021-01-01 19:00:52"),
    (3,  102, 1, " ", " ", "2021-01-02 23:51:23"),
    (3,  102, 2, " ", null, "2021-01-02 23:51:23"),
    (4,  103, 1, "4", " ", "2021-01-04 13:23:46"),
    (4,  103, 1, "4", " ", "2021-01-04 13:23:46"),
    (4,  103, 2, "4", " ", "2021-01-04 13:23:46"),
    (5,  104, 1, null, 1, "2021-01-08 21:00:29"),
    (6,  101, 2, null, null, "2021-01-08 21:03:13"),
    (7,  105, 2, null, 1, "2021-01-08 21:20:29"),
    (8,  102, 1, null, null, "2021-01-09 23:54:33"),
    (9,  103, 1, "4", "1, 5", "2021-01-10 11:22:59"),
    (10, 104, 1, null, null, "2021-01-11 18:34:49"),
    (10, 104, 1, "2, 6", "1, 4", "2021-01-11 18:34:49");

 * sqlite://
Done.
Done.
14 rows affected.

[]

In [5]:
%%sql
DROP TABLE IF EXISTS pizza_names;
CREATE TABLE pizza_names ("pizza_id" INTEGER,
                          "pizza_name" TEXT);
INSERT INTO pizza_names ("pizza_id", "pizza_name")
VALUES 
    (1, 'Meatlovers'),
    (2, 'Vegetarian');

 * sqlite://
Done.
Done.
2 rows affected.

[]

In [6]:
%%sql
DROP TABLE IF EXISTS pizza_recipes;
CREATE TABLE pizza_recipes("pizza_id" INTEGER,
                           "toppings" TEXT);
INSERT INTO pizza_recipes("pizza_id", "toppings")
VALUES
    (1, "1, 2, 3, 4, 5, 6, 8, 10"),
    (2, "4, 6, 7, 9, 11, 12");

 * sqlite://
Done.
Done.
2 rows affected.

[]

In [7]:
%%sql
DROP TABLE IF EXISTS pizza_toppings;
CREATE TABLE pizza_toppings("topping_id" INTEGER,
                            "topping_name" TEXT);
INSERT INTO pizza_toppings("topping_id", "topping_name")
VALUES
    (1, "Bacon"),
    (2, "BBQ Sauce"),
    (3, "Beef"),
    (4, "Cheese"),
    (5, "Chicken"),
    (6, "Mushrooms"),
    (7, "Onions"),
    (8, "Pepperoni"),
    (9, "Peppers"),
    (10, "Salami"),
    (11, "Tomatoes"),
    (12, "Tomato Sauce");

 * sqlite://
Done.
Done.
12 rows affected.

[]

1. How many pizzas were ordered?

In [8]:
%%sql

SELECT COUNT(pizza_id) as number_pizza
FROM customer_orders

 * sqlite://
Done.

[(14,)]

2. How many unique customer orders were made?

In [9]:
%%sql
SELECT COUNT(DISTINCT order_id) as unique_customers
FROM customer_orders

 * sqlite://
Done.

[(10,)]

3. How many successful orders were delivered by each runner?

In [10]:
%%sql

SELECT runner_id,
    COUNT(order_id) as deliveries
FROM runner_orders
WHERE distance > 0
GROUP BY runner_id

 * sqlite://
Done.

[(1, 4), (2, 3), (3, 1)]

4. How many of each type of pizza was delivered?

In [11]:
%%sql

SELECT 
    pizza_name,
    COUNT(customer_orders.pizza_id) AS delivered
FROM customer_orders
JOIN runner_orders
    ON customer_orders.order_id = runner_orders.order_id
JOIN pizza_names
    ON customer_orders.pizza_id = pizza_names.pizza_id
WHERE distance > 0
GROUP BY pizza_name

 * sqlite://
Done.

[('Meatlovers', 9), ('Vegetarian', 3)]

5. How many Vegetarian and Meatlovers were ordered by each customer?

In [12]:
%%sql

SELECT
    customer_id,
    p.pizza_name,
    COUNT(p.pizza_name) AS how_many_pizzas
FROM customer_orders AS c
JOIN pizza_names AS p 
    ON c.pizza_id = p.pizza_id
GROUP BY c.customer_id, p.pizza_name

 * sqlite://
Done.

[(101, 'Meatlovers', 2),
 (101, 'Vegetarian', 1),
 (102, 'Meatlovers', 2),
 (102, 'Vegetarian', 1),
 (103, 'Meatlovers', 3),
 (103, 'Vegetarian', 1),
 (104, 'Meatlovers', 3),
 (105, 'Vegetarian', 1)]

6. What was the maximum number of pizzas delivered in a single order?

In [13]:
%%sql

SELECT order_id, COUNT(order_id) AS count
FROM customer_orders
GROUP BY order_id
ORDER BY count DESC
LIMIT 1;

 * sqlite://
Done.

[(4, 3)]

7. For each customer, how many delivered pizzas had at least 1 change and how many had no changes?

In [30]:
%%sql

SELECT 
    customer_id,
    SUM(CASE WHEN exclusions != ' ' OR extras != ' '
            THEN 1
            ELSE 0
            END) AS atleast1change,
    SUM(CASE WHEN exclusions = ' ' OR extras = ' ' 
             THEN 1
             ELSE 0
             END) as nochange
FROM customer_orders AS c
JOIN runner_orders AS r
    ON c.order_id = r.order_id
GROUP BY customer_id;

 * sqlite://
Done.

[(101, 0, 2), (102, 0, 2), (103, 3, 2), (104, 2, 0), (105, 1, 0)]

8. How many pizzas were delivered that had both exclusions and extras?

In [36]:
%%sql

SELECT
    COUNT(CASE WHEN exclusions IS NOT NULL AND extras IS NOT NULL
               THEN 1
               ELSE 0
               END) AS fussy_eaters
FROM customer_orders AS c
JOIN runner_orders AS r
    ON c.order_id = r.order_id
WHERE distance > 0
    AND exclusions != ' '
    AND extras != ' ';

 * sqlite://
Done.

[(1,)]

9. What was the total volume of pizzas ordered for each hour of the day?

Please note, this solution includes all orders, including orders that were cancelled for whatever reason. include 'WHERE cancellation IS NULL' to get around this.

In [63]:
%%sql

SELECT count(c.order_id) as orders,
    strftime('%H', order_time) as hour
FROM customer_orders AS c
JOIN runner_orders AS r
    ON c.order_id = r.order_id

GROUP BY hour
ORDER BY hour;

 * sqlite://
Done.

[(1, '11'), (3, '13'), (3, '18'), (1, '19'), (3, '21'), (3, '23')]

10. What was the volume of orders for each day of the week? <a href = 'https://www.sqlitetutorial.net/sqlite-date-functions/sqlite-strftime-function/'>help here</a>. Reminder Sunday = 0, Monday= 1, Tuesday = 2

In [69]:
%%sql

SELECT count(c.order_id) AS orders,
    strftime('%w', order_time) as day
FROM customer_orders AS c
GROUP BY day
ORDER BY day;

 * sqlite://
Done.

[(1, '0'), (5, '1'), (5, '5'), (3, '6')]